app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Julia"], ["body", "It's cool"], ["post_id", 2], ["created_at", "2019-02-13 12:24:42.852960"], ["updated_at", "2019-02-13 12:24:42.852960"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save