app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "text", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["text", ""], ["date", "2019-02-13 12:11:00"], ["created_at", "2019-02-13 12:11:43.040751"], ["updated_at", "2019-02-13 12:11:43.040751"]]